#Задача 2: Найдите сумму цифр трехзначного числа.
n = int(input('Введите трехзначное число '))
print(n, '->', (n//100 + (n % 100)//10 + n % 10),
      f'({n//100} + {(n % 100)//10} + {n % 10})')